[
  {
    "name": "Walk",
    "type": "",
    "description": "You can use your main action to move up to your movement speed. This action is not strenuous and takes little energy but is not especially useful in combat."
  },
  {
    "name": "Charge",
    "type": "",
    "description": "You can use your main action to move up to your movement speed and make a single attack. If the movement is at least half of your total move speed and in a straight line you gain +2 to hit as long as you are using a melee weapon."
  },
  {
    "name": "Full Attack",
    "type": "",
    "description": "You can move 5 feet and make as many attacks as you are allowed to take."
  },
  {
    "name": "Withdraw",
    "type": "",
    "description": "You can move up to twice your movement speed. You do not provoke an attack of opportunity from leaving any enemies reach."
  },
  {
    "name": "Run",
    "type": "",
    "description": "You can move up to three times your movement speed."
  },
  {
    "name": "Hide",
    "type": "",
    "description": "You can move up to your movement and attempt to hide if you are out of sight of whoever you are attempting to hide from. When you are hidden you have advantage on attacks against people who cannot see you."
  },
  {
    "name": "Sneak",
    "type": "",
    "description": "If you are hidden, you can move up to your movement and remain hidden, as long as you do not move into the sight of whoever you are hiding from."
  },
  {
    "name": "Dodge",
    "type": "",
    "description": "You can use your main action to move up to your movement speed and impose disadvantage to any creature attacking you that you can see until the start of your next turn."
  },
  {
    "name": "Cast a spell",
    "type": "",
    "description": "You can use your main action to move 5 feet and cast a spell. If the spell has a casting time of more than one turn, you must use repeat this action each turn until the spell is cast. If you do not the spell is lost, and you must still pay the cost of the spell."
  },
  {
    "name": "Ready Attack",
    "type": "",
    "description": "You can use your main action to move 5 feet and ready a single attack or a spell that has a one turn casting time. You must declare under what conditions your attack or spell will happen. If that condition occurs before your next turn you can immediately attack or cast the spell."
  },
  {
    "name": "Take cover",
    "type": "",
    "description": "You can use your main action to move up to your movement speed and take cover behind cover if any is available."
  },
  {
    "name": "Grappling",
    "type": "",
    "description": 
      "You can use your main action to move up to your movement speed and attempt to grapple another creature. To do this you must roll a strength check against your target’s strength or dexterity check.\n Each size category difference between the creature and the target gives a -5 penalty on this roll.\n If your roll is higher than your target’s, you successfully grapple the target.\n You may release a grapple at any time. When you release a grapple, the target may immediately make a grapple check against you.\n You can attempt to grapple in place of an Attack of Opportunity.\nIf you move while grappling another creature, your movement speed is halved, and the grappled creature moves with you. Size differences between you and your grappled target might result in different movement penalties. \nTo escape a grapple the creature must use its main action and pass a contested strength or dexterity check against the grappling creatures strength check.\n If the grappling creature is knocked prone or moved against its will the grapple is released, unless the grappler is significantly larger than the target. \n Once you have a creature grappled you can take a number of special actions on your next turn in addition to any normal actions."
  },
  {
    "name": "Body Shield",
    "type": "Grapple",
    "description": "You can use a bonus action to use the creature as cover. Any attack that targets you has a 50% chance to instead target the creature."
  },
  {
    "name": "Execute",
    "type": "Grapple",
    "description": "You use one of your attacks to attempt to slit the targets throat, stab them in the back or otherwise kill them. Roll an attack at advantage. If this attack hits it is a critical hit."
  },
  {
    "name": "Disarming",
    "type": "Grapple",
    "description": "You can use a bonus action to attempt to disarm your grappled target. The creature has disadvantage on the strength check to avoid dropping their weapon."
  },
  {
    "name": "Pushing",
    "type": "",
    "description": "In the place of a single attack you can attempt to shove, either with a shield or a free hand. Roll a strength check opposed by your target’s strength or dexterity. If you win you can choose to either push them back 10 feet or knock them prone. If you charge you can push with a shoulder rather than a shield or free hand."
  },
  {
    "name": "Disarming",
    "type": "",
    "description": "In the place of a single attack you can attempt to disarm a foe. Roll an attack at disadvantage and with a -5 to hit, -10 if the weapon is being held in two hands. If it hits the target must make a strength check against your DC or drop the weapon."
  }
]