[
    {
        "name": "Silver Essence (DC 12)",
        "type":"",
        "description": "Use a turn to coat your weapon with this silver essence. You weapon counts as silvered for the next minute."
    },
    {
        "name": "Restorative Draught (DC 20)",
        "type":"",
        "description": "The drinker can spend a restoration dice as if they had a short rest."
    },
    {
        "name": "Throwing Fire (DC 12)",
        "type":"",
        "description": "Make a ranged attack, on a hit deal 2d4 fire damage. Range: 20 ft."
    },
    {
        "name": "Flash Powder (DC 15)",
        "type":"",
        "description": "This powder ignites and produces a bright flash, any creature within 5ft of the powder must make a fortitude save or be blinded for 1d3 rounds."
    },
    {
        "name": "Smoke Bombs (DC 10)",
        "type":"",
        "description": "These bombs create areas of dark smoke."
    },
    {
        "name": "Smelling Salts (DC 10)",
        "type":"",
        "description": "These smelling salts can be administered as an action to a creature over its wound limit. The creature can ignore one wound for 10 minutes but is stunned during that time. Consecutive used can be dangerous."
    },
    {
        "name": "Stone to Flesh (DC 25)",
        "type":"",
        "description": "This disgusting mixture can save those turned to stone by some monsters."
    },
    {
        "name": "Ariticeack",
        "type":"",
        "description": "This poison, brewed from the Ariti flower, inhibits magical power in those who take it. Any spells cast while poisoned by Artiticack cost 1 extra spellcasting ability point."
    },
    {
        "name": "Thanadel",
        "type":"",
        "description": "When ingested, this poison forces the target to make a DC 20 fortitude save or take 1d4 mortal wound."
    },
    {
        "name": "Daemonbane",
        "type":"",
        "description": [
            "This plant was a gift from the gods and causes immense pain in any daemons it comes into contact with.",
            "A vial of this poison can be thrown at a daemon. On a hit it deals 2d12 damage. It can also be applied to a weapon. For one minute any hit with that weapon against a daemon deals an extra 1d8 damage."
        ]
    },
    {
        "name": "Stolen Venom",
        "type":"",
        "description": "This poison is harvested from a creature with venom. It can be applied to a weapon. For the next minute the weapon deals an extra 2d6 damage on a hit."
    },
    {
        "name": "Waeberry",
        "type":"",
        "description": [
            "This berry, identical to a blueberry in every way, leads to horrific vomiting, internal bleeding, and death.",
            "1 hour after a creature eats this berry, they must make a DC 15 fortitude save or take 1d2 minor wounds and be poisoned for 24 hours. After another hour the creature must make a DC 18 fortitude save or take a major wound. After the 3rd hour the creature must make a final fortitude save at DC 20 or take a mortal wound."
        ]
    },
    {
        "name": "Hastab",
        "type":"",
        "description": "This purple leafed plant causes vivid hallucinations when taken. It draws the taker to the field of dreams."
    }
]