[
  {
    "name": "Incapacitated",
    "type": "",
    "description": "An incapacitated creature cannot take any actions. An incapacitated creature speed is 0 and it cannot be increased by any means."
  },
  {
    "name": "Petrified",
    "type": "",
    "description": "A petrified creature is turned to stone. It is incapacitated and is unaware of its surroundings. Any damage dealt to the statue carries over to the creature should it be restored to life."
  },
  {
    "name": "Unconscious",
    "type": "",
    "description": "An unconscious creature is incapacitated and prone. A hit against an unconscious creature is always a critical hit and ignores all the targets defence."
  },
  {
    "name": "Paralysed",
    "type": "",
    "description": "A paralysed creature is incapacitated and prone. A hit against a paralysed creature is always a critical hit and ignores half the targets defence."
  },
  {
    "name": "Frightened",
    "type": "",
    "description": "While frightened a creature must move away from whatever frightened it, if it is within 60ft of the source of its fear. It has disadvantage on all attacks and ability tests while it can see or is otherwise aware of the source of its fear."
  },
  {
    "name": "Confused",
    "type": "",
    "description": "At the start of a confused creatures turn it must roll a d8. A confused creature has disadvantage on any attack or test that requires",
    "table:": "d8\n1 Attack the nearest target.    \n2 – 3 Withdraw in a random direction. \n 4 – 5 Take cover at a random piece of cover within distance. \n 6 – 7 Do nothing 8 Act normally this round."
  },
  {
    "name": "Poisoned",
    "type": "",
    "description": "If a creature is poisoned or sicked it has its movement speed halved and the creature has disadvantage on all attack rolls and reflex saving throws."
  },
  {
    "name": "Sickened",
    "type": "",
    "description": "If a creature is poisoned or sicked it has its movement speed halved and the creature has disadvantage on all attack rolls and reflex saving throws."
  },
  {
    "name": "Prone",
    "type": "",
    "description": [
      "If a creature is knocked prone, or falls prone willingly, its movement speed becomes 5 ft unless it would otherwise be lower and attacks against it from within 5 feet range have advantage. Ranged attacks against a prone creature have disadvantage.",
      "To stand up from prone your movement speed cannot be 0. You must take an action that lets you move up to your movement speed. If you would normally be able to move your movement speed a number of times you can move it one less time. If you would normally move up to your movement speed you instead do not move this turn.",
      "If a flying creature is knocked prone, it falls, unless it is flying through magic."
    ]
  },
 
  {
    "name": "Restrained",
    "type": "",
    "description": "A restrained creature cannot move and has disadvantage on attack rolls, strength and dexterity tests and Avoidance Saves. Attacks against a restrained creature have advantage."
  },
  {
    "name": "Grappled",
    "type": "",
    "description": [
      "A grappled creature cannot move and has disadvantage on attacks. When attacking a creature that is grappled the target gains +3 to armour class unless the attacking creature is the one performing the grapple.",

      "An attack against a grappled creature can critically fail, hitting the creature doing the grapple on a critical failure. You cannot hit yourself with a critically failed attack.",

      "To cast a spell while grappled a creature must make a DC 12 concentration test each round they cast.",
      
      "To escape a grapple the creature must use its main action and pass a contested strength or dexterity test against the grappling creatures strength test."
    ]
  },
  {
    "name": "Blinded",
    "type": "",
    "description": "A blinded or blind creature cannot see. It automatically fails any perception tests or any other tests relying on sight. Its movement speed is halved while blinded."
  },
  {
    "name": "Stunned",
    "type": "",
    "description": "A stunned creature can only take the Take Cover, Hide, Walk, or Full Attack actions on its turn. The creature can only make a single attack at disadvantage and its movement speed is reduced to 5ft. Any attempt to hide has disadvantage and a -5 penalty on the test."
  },
  {
    "name": "Slowed",
    "type": "",
    "description": "A slowed creature has its movement speed reduced by half. It has disadvantage on Avoidance Saves. The creature can only make half the number of attacks it usually can, and any spells take twice as long as normal to cast. The creature cannot take any action outside of its turn."
  },
  {
    "name": "Fascinated",
    "type": "",
    "description": "A fascinated creature cannot look away from whatever is fascinating them."
  },
  {
    "name": "Damage Over Time",
    "type": "",
    "description": "ome effects will continue doing damage over time. Common examples are bleeding or some poisons. A damage over time effect deals damage on the turn of which ever creature caused the damage."
  },
  {
    "name": "Enthralled",
    "type": "",
    "description": [
      "Sometimes known as charmed, a creature that is enthralled cannot attack the creature that is enthralling it, the enthralling creature has advantage on any charisma tests against the enthralled creature and the enthralled creature regards the enthraller as a friend or trusted companion.",
      "Often effects that enthral a target will have additional effects"
    ]
  },
  {
    "name": "Surprised",
    "type": "",
    "description": [
      "When a combat begins one side might be surprised by the other, if they are unaware of their attackers, or if they are not expecting an assault.",
      "If a creature is surprised at the start of combat, they cannot take a combat turn until they are aware of a threat. Once a surprised creature has started its turn it is no longer surprised.",
      "A surprised creature cannot take actions outside of its turn.",
      "A creature ceases to be surprised once it acts."
    ]
  }
]