[
  {
    "name": "Ability Trait",
    "type": "",
    "description": "Select one ability score. You gain +1 to this ability score."
  },
  {
    "name": "Athletic",
    "type": "",
    "description": "You gain a +1 bonus to any skill using strength and can carry one extra weapon."
  },
  {
    "name": "Arcane Crafter",
    "type": "",
    "description": "During your downtime you can attempt to create wands and scrolls. You count as trained for tests for crafting such items."
  },
  {
    "name": "Blacksmith",
    "type": "",
    "description": "During your downtime you can attempt to create metal weapons and armour. You count as trained for tests for crafting such items."
  },
  {
    "name": "Cautious",
    "type": "",
    "description": "You gain a +2 bonus to perception when looking for traps or for hidden enemies. You also gain a +2 bonus to initiative."
  },
  {
    "name": "Cute",
    "type": "",
    "description": "You are cute, gaining +2 on charisma tests against people who are/would be/could be attracted to you."
  },
  {
    "name": "City Dweller",
    "type": "",
    "description": "You can move through crowds quickly and know where to find shops and other locations of interest in cities."
  },
  {
    "name": "Criminal Contacts",
    "type": "",
    "description": "Your former (or current) lifestyle allows you to find the underbelly of cities and open up opportunities that are not available to normal folk."
  },
  {
    "name": "Cruel Upbringing",
    "type": "",
    "description": "You gain resistance to sanity damage."
  },
  {
    "name": "Distracting",
    "type": "",
    "description": "You draw the attention of others, both in combat and in social situations."
  },
  {
    "name": "Distinctive",
    "type": "",
    "description": "You are easy to remember, for better or worse."
  },
  {
    "name": "Fae Touched",
    "type": "",
    "description": "You once had an encounter with a fae. Once per long rest you can gain advantage on a save against an enthral effect."
  },
  {
    "name": "Forgettable Face",
    "type": "",
    "description": "Your face is easily forgettable, allowing you to blend into crowds, not arouse suspicion and other useful things."
  },
  {
    "name": "Gunsmith",
    "type": "",
    "description": "During your downtime you can attempt to create firearms. You count as trained for tests for crafting such items."
  },
  {
    "name": "Heavy Drinker",
    "type": "",
    "description": "You have a high tolerance to alcohol and it takes twice as much to get you drunk. You get +2 on resistance saves against poison."
  },
  {
    "name": "Heirloom Weapon",
    "type": "",
    "description": [
      "You start the game with one weapon that is not a firearm. When you attack with this weapon you can either get a +1 to hit or +1 to damage.",
      "Discuss with your DM about upgrading this weapon over time instead of finding loot."
    ]
  },
  {
    "name": "Leatherworker",
    "type": "",
    "description": "You work with leather to create armour and other useful things. You count as trained when making such items."
  },
  {
    "name": "Library Scholar",
    "type": "",
    "description": "Your upbringing among books and libraries allows you to always know where to find knowledge."
  },
  {
    "name": "Lost Love",
    "type": "",
    "description": "Once upon a time you had a lover who you cared for deeply. Though time or fate has separated you, you still draw solace from your time together. You have advantage on Mental Saves against fear."
  },
  {
    "name": "Orphan",
    "type": "",
    "description": "Your fates or your own actions have determined your call to adventure. You gain +1 on attack rolls or spell attack rolls."
  },
  {
    "name": "People Person",
    "type": "",
    "description": "You are charming and amicable. People tend to like you and people who like you tend to charge you less when buying goods or services."
  },
  {
    "name": "Performer",
    "type": "",
    "description": "You have learnt an instrument and can perform to cheapen your cost of staying in towns or cities."
  },
  {
    "name": "Quick",
    "type": "",
    "description": "You gain a +5 ft. bonus to movement speed."
  },
  {
    "name": "Rare Language Learner",
    "type": "",
    "description": "You learn one language from the very rare language list."
  },
  {
    "name": "Religious Garb",
    "type": "",
    "description": "You can wear symbols of your religion over your armour. This indicates you as a religious warrior and you do not get charged extra for wearing armour."
  },
  {
    "name": "Sailor",
    "type": "",
    "description": "You know how to sail a ship and navigate dock areas."
  },
  {
    "name": "Shelter of the Faithful",
    "type": "",
    "description": "You have spent time in a church or temple and can seek refuge with such organisations."
  },
  {
    "name": "Skill Training",
    "type": "",
    "description": "Select one skill. It counts as trained for you."
  },
  {
    "name": "Skill Focus",
    "type": "",
    "description": "Select one skill. You gain a +3 bonus to that skill. You cannot select a skill that you are already gaining a bonus to from another trait. If you gain a bonus to this skill from another source you may replace this trait or use this bonus in place of the new bonus you are receiving."
  },
  {
    "name": "Soldier of Fortune",
    "type": "",
    "description": "You know where to find bounties or mercenary work."
  },
  {
    "name": "Survivalist",
    "type": "",
    "description": "You find twice as much food and water when foraging."
  },
  {
    "name": "Tough of Body",
    "type": "",
    "description": "You gain +1 defence."
  },
  {
    "name": "Tinkerer",
    "type": "",
    "description": "You can create small mechanical items. You count as trained for tests for crafting such items."
  },
  {
    "name": "Well-Travelled",
    "type": "",
    "description": "You learn 2 more languages, from the common or rare list."
  },
  {
    "name": "Young Start",
    "type": "",
    "description": "You have started your adventuring life much younger than usual. You cannot take more than 2 starting traits, including this one. You take a -2 penalty to strength, constitution, and wisdom scores but a +2 bonus to dexterity and charisma scores."
  },
  {
    "name": "Addiction",
    "type": "",
    "description": "You are addicted to a certain substance. For every day you do not intake the substance you must make a DC 20 fort save or have disadvantage on all attacks, saves and ability tests for that day, or until you intake the substance."
  },
  {
    "name": "Anger Issues",
    "type": "",
    "description": "You have disadvantage on all social tests besides intimidation."
  },
  {
    "name": "Blood Thirsty",
    "type": "",
    "description": "You have disadvantage on attacks against targets that are neither unconscious nor wounded when a wounded or unconscious target is available."
  },
  {
    "name": "Club Foot",
    "type": "",
    "description": "One of your feet is damaged or cut off, replaced with a wooden leg or feet. Your movement speed is reduced by 10ft."
  },
  {
    "name": "Clumsy",
    "type": "",
    "description": "You have a knack for knocking things over, and people take cover when you go to throw something. Your dexterity score is reduced by 2."
  },
  {
    "name": "Code of Honour",
    "type": "",
    "description": "You have a strict code of honour. When acting against your code of honour you have disadvantage on all actions until you redeem yourself."
  },
  {
    "name": "Combat Paralysis",
    "type": "",
    "description": "You must pass a DC 15 mental save at the start of combat in order to act on the first turn."
  },
  {
    "name": "Deaf",
    "type": "",
    "description": "You are deaf or extremely hard of hearing. You automatically fail any test to hear something and are immune to any effect based on sound. You and your fellow party members can select a sign language as one of your bonus languages."
  },
  {
    "name": "Fae Addled",
    "type": "",
    "description": "You once had an encounter with a fae. You have disadvantage on saves against enthral effects."
  },
  {
    "name": "Foolhardy",
    "type": "",
    "description": "You cannot dodge or take cover."
  },
  {
    "name": "Haemophilia",
    "type": "",
    "description": "You have -2 on resistance saves to heal wounds."
  },
  {
    "name": "Illiterate",
    "type": "",
    "description": "You can neither read nor write. Maybe you just never learned or maybe you have a learning disability that makes it hard for you to learn."
  },
  {
    "name": "Insane",
    "type": "",
    "description": "You see the world in a different light to most people. Whenever you take sanity damage you take twice as much and whenever your maximum sanity is reduced the reduction is also doubled. When you roll on a madness table you can roll twice and select which result to use."
  },
  {
    "name": "Kidnapped",
    "type": "",
    "description": "You were taken into the fae as a child. You have disadvantage on all charisma tests with non-fae."
  },
  {
    "name": "Disgraced",
    "type": "",
    "description": "You betrayed your country, faction, city, or guild, publicly. It is unlikely that anyone will trust you with any sensitive information, and you may have trouble acquiring basic services from certain merchants/group."
  },
  {
    "name": "Known Traitor",
    "type": "",
    "description": "You betrayed your country, faction, city, or guild, publicly. It is unlikely that anyone will trust you with any sensitive information, and you may have trouble acquiring basic services from certain merchants/group."
  },
  {
    "name": "Lame",
    "type": "",
    "description": "Both your legs do not work correctly, either due to injury or some other cause. You are always prone unless you are riding a creature or being carried. You must purchase a special saddle for any creature you ride."
  },
  {
    "name": "Lost an Arm",
    "type": "",
    "description": "You are missing an arm."
  },
  {
    "name": "Lost an Eye",
    "type": "",
    "description": "You have disadvantage on perception tests."
  },
  {
    "name": "Mute",
    "type": "",
    "description": "You cannot speak. You and your fellow party members can select a sign language as one of your bonus languages."
  },
  {
    "name": "Nervous",
    "type": "",
    "description": "You have disadvantage on saves against fear."
  },
  {
    "name": "Old",
    "type": "",
    "description": "You are older than most adventurers, and with this age comes a weakening of the body but a strengthening of the mind. You gain a +2 bonus to wisdom and a +1 bonus to intelligence. You gain a -2 penalty to strength, constitution, and dexterity."
  },
  {
    "name": "Physically Weak",
    "type": "",
    "description": "You are weak and unable to lift heavy things. Your strength score is reduced by 2."
  },
  {
    "name": "Superstitious",
    "type": "",
    "description": "You strongly believe certain actions will have certain consequences, despite what logic would say. Discuss with your GM. \n This drawback can be reflavoured to be compulsive or extremely picky about food, or many other things."
  },
  {
    "name": "Sickly",
    "type": "",
    "description": "Your body is frail, and you get sick easily. Your constitution score is reduced by 2."
  },
  {
    "name": "Stupid",
    "type": "",
    "description": "Your brain does not work as well as other peoples. Your intelligence score is reduced by 2."
  },
  {
    "name": "Ugly",
    "type": "",
    "description": "You are staggeringly unpleasant to gaze upon. Your charisma score is reduced by 2."
  },
  {
    "name": "Voices",
    "type": "",
    "description": "You hear voices in your head telling you to do things. This voice could be the voice of a god, your own delusions or something more sinister. Consult your GM."
  },
  {
    "name": "Wanted",
    "type": "",
    "description": "You are wanted by a group of people. Work out details with your GM. This group of people will attempt to hunt you down."
  },
  {
    "name": "Weak to Magic",
    "type": "",
    "description": "A childhood curse or arcane accident has left you vulnerable to magic and magical effects, you have disadvantage on saves against spells and other magical effects."
  },
  {
    "name": "Weak Willed",
    "type": "",
    "description": "You are not as strong willed as other people. Your wisdom score is reduced by 2"
  },
  {
    "name": "Stage Fright",
    "type": "",
    "description": "You suffer disadvantage on charisma and wisdom tests when in or in front of large crowds."
  },
  {
    "name": "Phobia",
    "type": "",
    "description": "You have an intense fear of a certain creature or effect, for example: fire, spiders, heights. When confronted with the object of your phobia you must make a DC 15 Mental Save or take 1 irresistible sanity damage and be frightened for a round."
  },
  {
    "name": "Lack of Confidence",
    "type": "",
    "description": "Whenever you fail a test you have a -5 penalty on that skill for an hour."
  },
  {
    "name": "Forgetful",
    "type": "",
    "description": "Whenever you stay at a location for more than an hour you must make a DC 10 Mental Save or leave an item behind, such as a few coins, a small dagger or similar. If you critically fail this test you might instead leave an important weapon or piece of information instead."
  },
  {
    "name": "Dark Mark",
    "type": "",
    "description": "You have a symbol of an evil god or other dark entity burned into your flesh. You have disadvantage and a -2 penalty on all charisma tests with decent people. You are charged an extra 100% for all goods and services."
  }, 
   {
    "name": "Hedonist",
    "type": "",
    "description": "Each day you do not spent at least an hour in pleasurable activities you must make DC 15 Mental Save or have disadvantage on initiative and perception tests for the next day."
  },
  {
    "name": "Slow on the Uptake",
    "type": "",
    "description": "You have disadvantage on initiative tests or perception tests to spot hidden enemies or traps."
  }
]